Tekla Open API Reference for Tekla Structures 2025
AnalysisPartEnd.SupportCoordSystem Property
 The coordinate system of the support.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public CoordinateSystem SupportCoordSystem { get; set; }
Public Property SupportCoordSystem As CoordinateSystem
	Get
	Set
Property Value
Type: CoordinateSystem
See Also
Reference
AnalysisPartEnd Class
Tekla.Structures.Analysis Namespace